document.addEventListener('DOMContentLoaded', function () {

    console.log('====== 1) Найти параграф и получить его текстовое содержимое=======);
    console.log('====== 2) создать ф-ю которая принимает как аргумент узел-DOM и возвращает информацию в виде объекта с данными о типе узла, об имени узла о количестве дочерних элементов======');
    console.log('=== Получить массив, котор. состоит из текстового содержимого ссылок внутри списка ===');
    console.log('=== В параграфе заменить все дочерние текстовые узлы на "-text-"===');


});